<template>
  <div>
    <h3 class="title">用户注册协议</h3>
    <p>
      本人知悉重庆久佳辰康健康科技有限公司（以下简称公司）并非医疗机构，公司不提供医疗诊断服务及药品销售，本人委托公司提供HPV疫苗接种流程服务，根据《中华人民共和国合同法》，双方本着平等互利的原则，达成如下协议。
    </p>
    <h4>1.服务内容概述</h4>
    <p>
      公司同意在协议签署之日起服务期限内，为本人提供HPV疫苗接种流程服务、专业医疗健康咨询、接种疫苗专人预约、宫颈细胞学检查。公司客观介绍相关港澳专业医疗机构情况，本人可自愿决定接受具有专业资质的医疗机构提供的HPV疫苗接种服务。
    </p>
    <h4>2.服务内容	</h4>
    <p>
      公司服务内容包含：
      <br/>
      2.1在线/电话向本人提供HPV疫苗接种流程服务及专业健康咨询解答
      <br/>
      2.2为本人客观介绍相关港澳专业医疗机构情况以及医生相关信息服务
      <br/>
      2.3预约专员负责协助本人联系港澳医疗机构以及HPV疫苗接种流程的预约服务
      <br/>
      2.4在本人支付流程服务意向金 1000 元后，公司赠送一次宫颈细胞学检查给予本人（仅针对有性经验的女性，因无性经验女性无法进行细胞学检查）
      <br/>
      2.5若本人宫颈细胞学检查结果呈阳性，公司可为本人提供对接医生咨询服务
    </p>
    <h4>3.双方权利、义务</h4>
    <p>
      <span class="bole">3.1本人权利、义务</span><br/>
      3.1.1本人自行提供资料至港澳医疗机构，并自行确保提供的资料内容真实、准确、完整。<br/>
      3.1.2本人自行确定医疗机构后，将其自行选择确定的医疗机构指令给公司。<br/>
      3.1.3本人有权随时了解预约进展情况。<br/>
      3.1.4双方确定接种时间后，本人不得随意变更时间。变更时间时，公司无法向本人提供本协议约定的服务。届时公司不承担任何责任，本人已支付的服务费用，公司无需退还。<br/>
      <span class="bole">3.2公司权利、义务</span><br/>
      3.2.1公司所提供的的相关工作应在接到本人指令后执行。所有公司代本人发送的信息需经本人书面（含邮件与即时通信工具）指令后方可发送。<br/>
      3.2.2在服务期限内执行过程中，公司就本协议约定的服务内容和工作进程安排及时与本人沟通。<br/>
      3.2.3对本人提供相关的医疗咨询服务，公司应履行保密义务。除为执行本协议约定外，不得用于其他任何用途。<br/>
      3.2.4公司不销售药品，只向本人收取流程服务费用。
    </p>
    <h4>4.费用及支付</h4>
    <p>本人自愿向公司支付服务费。</p>

    <h4>5.声明及保证</h4>
    <p>
      5.1公司只提供本协议第2条之服务内容项下的服务，服务期内，药品是本人自行购买，公司只为本人提供咨询服务，本人的任何用药应在医生指导下使用，用药是否有效果及用药导致的副作用等均与公司无关，但公司提供后续跟踪服务。<br/>
      5.2本人保证提供给公司的全部信息全面、客观、真实、准确、有效，并且不会侵害任何第三方的合法权益。如因本人违反上述保证而引起任何争议，本人应负责解决。
    </p>
    <h4>6.不可抗因素导致无法正常履行服务内容</h4>
    <p>双方遇有无法控制的事件或情况应视为不可抗因素事件，包括但不限于火灾、风灾、水灾、地震、爆炸、战争、叛乱、暴动、传染病、瘟疫及所在地区医疗政策变化等。凡因不可抗拒的原因致使本协议无法履行的，在不可抗因素事件结束后三日内，发生不可抗因素的一方必须以书面形式通知对方。由于不可抗因素造成的损失，双方互不承担责任，但均有义务立即采取合理、可行的措施，避免损失的扩大，若非完全不能履行本协议，应在不可抗因素事件消除七日内继续履行。</p>
    <h4>7.争议解决与适用法律</h4>
    <p>本协议的解释和履行适用中华人民共和国法律，双方在履行本协议中出现争议，应通过友好协商解决，若协商不成时，任何一方均可向公司所在地人民法院提起诉讼。</p>
    <h4>8.其他</h4>
    <p>8.1本人应保护公司的商业秘密；公司对本人向其披露的个人隐私资料内容保密；双方的保密期限为永久。<br/>
      8.2本协议执行过程中，公司只对本协议约定的公司需履行的服务内容负责，除此之外本人身体伤害、健康问题或本人自身健康原因造成的损害，公司不承担任何责任。<br/>
      8.3订立本协议所依据的法律、行政法规、规章或订立本协议所依据的客观情况发生重大变化，致使本协议无法履行的，经双方协商一致，可以变更，解除本协议的相关内容，但变更内容均应以书面形式确定。<br/>
      8.4未经另一方事先书面同意，任何一方不得全部或部分向其他第三方转让其在本协议中的权利和（或）义务。</p>
    <p class="bole">提示：本人已确认知悉公司为非医疗机构，公司不提供任何诊疗服务与药品代购服务，公司只针对本人赴港澳医疗机构购买（在本地注射）或接种HPV疫苗进行咨询预约服务负责。</p>
    <br/>
    <Button type="success" class="center" @click="back">返回</Button>
  </div>
</template>

<script type="text/ecmascript-6">
  export default {
    name: 'agreement',
    methods: {
      back() {
        this.$router.go(-1);
      },
    },
  };
</script>

<style scoped>
  p{
    margin: .4rem 0;
    color: #666;
    line-height: 1.5rem;
  }
  .title{
    text-align: center;
  }
  .center {
    margin: 0 auto;
    display: block;
  }
  .ttt{
    color: #2d8cf0;
  }
  .bole{
    font-weight: 800;
  }
</style>
